Revit 2024 API
SiteSubRegion.HostId Property
 The element id of the topography surface hosting this SiteSubRegion.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId HostId { get; }
Visual Basic
Public ReadOnly Property HostId As ElementId
	Get
Visual C++
public:
property ElementId^ HostId {
	ElementId^ get ();
}
See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace